import React,{useState,useEffect} from 'react';


function Exc2() {
const questions = [
  {
    "questionText": "Το προσφυγικό ρεύμα από τις βόρειες ελληνικές επαρχίες, Θεσσαλία, Μακεδονία και Ήπειρο δεν συνεχίστηκε κατά το δεύτερο έτος της Επανάστασης.",
    "isCorrect": "false"
  },
  {
    "questionText": "Οι πρόσφυγες από τη Θεσσαλομαγνησία και την Κεντρική  Μακεδονία κατευθύνθηκαν αρχικά προς τις Βόρειες Σποράδες και το Τρίκερι της Μαγνησίας.",
    "isCorrect": "true"
  },
  {
    "questionText": "Οι πρόσφυγες από την Ήπειρο και τα Άγραφα κινήθηκαν προς την Ανατολική Στερεά.",
    "isCorrect": "false"
  },
  {
    "questionText": "Μετά την καταστολή του κινήματος στον Όλυμπο, κατέφυγαν στις Σποράδες πολλοί αγωνιστές και οπλαρχηγοί από τη Μακεδονία και τη Θεσσαλία.",
    "isCorrect": "false"
  },
  {
    "questionText": "Ο προσφυγικός συνωστισμός στις Σποράδες είχε ως αποτέλεσμα την οργάνωση της τοπικής αυτοδιοίκησης.",
    "isCorrect": "false"
  },
  {
    "questionText": "Μετά την άφιξη των προσφύγων στις Σποράδες οι τοπικές αρχές βρέθηκαν αδύναμες, όχι μόνο να περιθάλψουν τους άπορους και πεινασμένους νεοφερμένους, αλλά και να διατηρήσουν την τάξη.",
    "isCorrect": "true"
  },
  {
    "questionText": "Οι πρόσφυγες από τον Όλυμπο προκαλούσαν κρούσματα βίας στις Σποράδες και απέβησαν στην πράξη κυρίαρχοι των νησιών και τρόμος των εγχωρίων.",
    "isCorrect": "true"
  },
  {
    "questionText": "Μετά την καταστολή του κινήματος, το καλοκαίρι του 1821, στην Ήπειρο, μεγάλα κύματα προσφύγων από την Ήπειρο κατευθύνθηκαν στη Δυτική Στερεά, για να αποφύγουν τα τουρκικά αντίποινα.",
    "isCorrect": "true"
  },
  {
    "questionText": "Οι Σουλιώτες στις αρχές του 1824 κατέφθασαν τελευταίοι στο Μεσολόγγι, μέσω των Ιόνιων νησιών.",
    "isCorrect": "false"
  },
  {
    "questionText": "Το Μεσολόγγι είχε πλέον επιβαρυνθεί υπερβολικά μετά τη εκδίωξη των Τούρκων από τη Δυτική Στερεά.",
    "isCorrect": "true"
  },
  {
    "questionText": "Προκειμένου να ανακουφιστεί το Μεσολόγγι από τη συνεχή εισροή προσφύγων, το Βουλευτικό παραχώρησε στους Σουλιώτες το Ζαπάντι, βορειοδυτικά του Αγρινίου.",
    "isCorrect": "true"
  },
  {
    "questionText": "Οι Μεσολογγίτες συμφώνησαν με την απόφαση για παραχώρηση γης για εγκατάσταση των προσφύγων.",
    "isCorrect": "false"
  },
  {
    "questionText": "Η απόφαση της κυβέρνησης για παραχώρηση γης στην ευρύτερη περιοχή του Μεσολογγίου στους πρόσφυγες αποτελεί την πρώτη ιδέα για αποκατάσταση προσφύγων στα χρόνια του Αγώνα.",
    "isCorrect": "true"
  },
  {
    "questionText": "Οι Σουλιώτες στη Γ’ Εθνοσυνέλευση έθεσαν ως βασικό θέμα την παραχώρηση τόπου για μόνιμη εγκατάσταση.",
    "isCorrect": "true"
  },
  {
    "questionText": "Σε όλη τη διάρκεια του 19ου αιώνα, απελευθερωτικά κινήματα ξέσπασαν στην τουρκοκρατούμενη ηπειρωτική Ελλάδα και την Κρήτη, με υποκίνηση ή ανοχή του ελληνικού κράτους.",
    "isCorrect": "true"
  },
  {
    "questionText": "Ένοπλοι Μακεδόνες, Ηπειρώτες και Κρήτες πρόσφυγες που είχαν εγκατασταθεί από τον καιρό της Επανάστασης στην ελεύθερη Ελλάδα, έδωσαν το παρών στα αλυτρωτικά και απελευθερωτικά κινήματα που ξέσπασαν στην τουρκοκρατούμενη ηπειρωτική Ελλάδα και την Κρήτη.",
    "isCorrect": "true"
  },
  {
    "questionText": "Τα προσφυγικά ρεύματα σε όλη τη διάρκεια του 19ου αιώνα δεν συνέβαλλαν ιδιαίτερα στην αύξηση του πληθυσμού της χώρας.",
    "isCorrect": "false"
  },
  {
    "questionText": "Το 1854 ο Κριμαϊκός πόλεμος γέννησε ελπίδες στους Έλληνες ότι έφθανε η ώρα της απελευθέρωσης αρκετών αλύτρωτων ακόμη περιοχών.",
    "isCorrect": "true"
  },
  {
    "questionText": "Τα κινήματα που οργάνωσαν επαναστατικά σώματα από την Ελλάδα προκειμένου να ξεσηκωθούν οι κάτοικοι αλύτρωτων περιοχών, κατά τη διάρκεια του Κριμαϊκού πολέμου, πέτυχαν το στόχο τους.",
    "isCorrect": "false"
  },
  {
    "questionText": "Όταν οι αντάρτες επέστρεψαν στην Ελλάδα, μετά την αποτυχημένη προσπάθειά τους να ξεσηκώσουν τους κατοίκους υπόδουλων ακόμη περιοχών, τους ακολούθησαν και πολλοί άμαχοι.",
    "isCorrect": "true"
  },
  {
    "questionText": "Ο Κριμαϊκός πόλεμος δεν έπληξε τους πρόσφυγες μέσα στην Αθήνα.",
    "isCorrect": "false"
  },
  {
    "questionText": "Κατά τη διάρκεια του Κριμαϊκού πολέμου, τα γαλλικά στρατεύματα κατοχής συνέβαλαν στη διάδοση της επιδημίας χολέρας στην Αθήνα.",
    "isCorrect": "true"
  },
  {
    "questionText": "Η επιδημία χολέρας έπληξε ιδιαίτερα το νότιο τμήμα της πόλης των Αθηνών, όπου κατοικούσαν πρόσφυγες.",
    "isCorrect": "true"
  },
  {
    "questionText": "Προκειμένου να αποκατασταθούν οι πρόσφυγες του 1854, ιδρύθηκε προσφυγικός συνοικισμός στο νότιο τμήμα της πόλης των Αθηνών.",
    "isCorrect": "false"
  },
  {
    "questionText": "Ο Ρωσοτουρκικός πόλεμος αναθέρμανε το όνειρο της ανάκτησης της Ηπείρου, της Θεσσαλίας και της Κρήτης.",
    "isCorrect": "false"
  },
  {
    "questionText": "Κατά τη διάρκεια του Ρωσοτουρκικού πολέμου, η Ελλάδα επιχείρησε να ενισχύσει την υπεράσπιση των ελληνικών δικαίων με την υπόθαλψη επαναστατικών κινημάτων στις επαρχίες αυτές.",
    "isCorrect": "true"
  },
  {
    "questionText": "Τον Ιανουάριο του 1878 ιδρύθηκε στην Αθήνα η Μακεδονική Επιτροπή, με σκοπό την αποκατάσταση των Μακεδόνων προσφύγων.",
    "isCorrect": "false"
  },
  {
    "questionText": "Οι Μακεδόνες πρόσφυγες της Νέας Πέλλας, και άλλοι της Εύβοιας, ανταποκρίθηκαν στις προσπάθειες της Μακεδονικής Επιτροπής να συγκεντρώσει στρατιωτική δύναμη.",
    "isCorrect": "true"
  },
  {
    "questionText": "Η επανάσταση που οργανώθηκε με τη βοήθεια της Μακεδονικής Επιτροπής ξέσπασε στον Όλυμπο, στα Πιέρια και στη Χαλκιδική και έληξε με ήττα των Ελλήνων επαναστατών από τους Τούρκους.",
    "isCorrect": "false"
  },
  {
    "questionText": "Ο ελληνοτουρκικός πόλεμος του 1897 δημιούργησε το τελευταίο ρεύμα (εσωτερικών) προσφύγων.",
    "isCorrect": "true"
  },
  {
    "questionText": "Μετά την ήττα του ελληνικού στρατού από τον τούρκικο στον ελληνοτουρκικό πόλεμο του 1897 και την υποχώρησή του, ακολούθησε και γενική έξοδος του άμαχου πληθυσμού, που έφευγε πανικόβλητος.",
    "isCorrect": "true"
  },
  {
    "questionText": "Η συνθήκη ειρήνης της Κωνσταντινούπολης προέβλεπε ρυθμίσεις στη θεσσαλική συνοριακή γραμμή με μικρές βελτιώσεις υπέρ των Ελλήνων.",
    "isCorrect": "false"
  }
]


  const [currentQuestion, setCurrentQuestion] = useState(0);
  const [showScore, setShowScore] = useState(false);
  const [score, setScore] = useState(0);
  const [answer, setAnswer] = useState('none');

  const handleAnswerOptionClick = (isCorrect,answer_button) => {
    if (isCorrect === answer_button) {
      setScore(score + 1);
      setAnswer('correct');
    }
    else{
      setAnswer('incorrect');
    }

  };

  const handleNext = () => {
    const nextQuestion = currentQuestion + 1;
    if (nextQuestion < questions.length) {
      setCurrentQuestion(nextQuestion);
    } else {
      setShowScore(true);
    }
    setAnswer('none');
  };

  function Correct(){
    return(
      <div className='question-section'>
      <div className='question-text'>Σωστή απάντηση!</div>
      <button  onClick={() => handleNext()}> Επόμενο </button>
      </div>
      
    );
  }

  return (

    <div className='app'>
          <div className='question-section'>
            <div className='question-count'>
              <span>Ερώτηση {currentQuestion + 1}</span>/{questions.length}
            </div>
            <div className='question-text'>{questions[currentQuestion].questionText}</div>
          </div>
          <div className='answer-section'>
            
            <button  onClick={() => handleAnswerOptionClick(questions[currentQuestion].isCorrect,'true')}> Σωστό </button>
            <button  onClick={() => handleAnswerOptionClick(questions[currentQuestion].isCorrect,'false')}> Λάθος </button>
          </div>

          <div className='question-section'>
          {answer === 'correct' && <Correct />}
        </div>

    </div>

    
  );
}

export default Exc2;